{
    "meals": [
        {
            "id": 1,
            "name": "Chorizo & mozzarella gnocchi bake",
            "cook_name": "Marianne Turner",
            "description": "Upgrade cheesy tomato pasta with gnocchi, chorizo and mozzarella for a comforting bake that makes an excellent midweek meal",
            "method:": "Heat the oil in a medium pan over a medium heat. Fry the onion and garlic for 8-10 mins until soft. Add the chorizo and fry for 5 mins more. Tip in the tomatoes and sugar, and season. Bring to a simmer, then add the gnocchi and cook for 8 mins, stirring often, until soft. Heat the grill to high. Stir ¾ of the mozzarella and most of the basil through the gnocchi. Divide the mixture between six ovenproof ramekins, or put in one baking dish. Top with the remaining mozzarella, then grill for 3 mins, or until the cheese is melted and golden. Season, scatter over the remaining basil and serve with green salad.",
            "prep_time": "10",
            "cook_time": "25",
            "difficulty": "Easy",
            "serves": "6",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/gnocchi-1d16725.jpg?quality=90&webp=true&resize=440,400",
            "ingredients": [
                "1 tbsp olive oil",
                "1 onion , finely chopped",
                "2 garlic cloves , crushed",
                "120g chorizo , diced",
                "2 x 400g cans chopped tomatoes",
                "1 tsp caster sugar",
                "600g fresh gnocchi",
                "125g mozzarella ball, cut into chunks",
                "small bunch of basil , torn",
                "green salad, to serve"
            ],
            "nutritional_info": {
                "kcal": "318",
                "fat": "13g",
                "saturates": "6g",
                "carbs": "36g",
                "sugars": "8g",
                "fibre": "4g",
                "protein": "13g",
                "salt": "1.7g"
            }
        },
        {
            "id": 2,
            "name": "Easy butter chicken",
            "cook_name": "Jennifer Joyce",
            "description": "Fancy a healthy version of your favourite Friday night curry? Try our easy butter chicken – the meat can be marinaded the day before so you can get ahead on your prep",
            "method:": "STEP 1 In a medium bowl, mix all the marinade ingredients with some seasoning. Chop the chicken into bite-sized pieces and toss with the marinade. Cover and chill in the fridge for 1 hr or overnight. STEP 2 In a large, heavy saucepan, heat the oil. Add the onion, garlic, green chilli, ginger and some seasoning. Fry on a medium heat for 10 mins or until soft. STEP 3 Add the spices with the tomato purée, cook for a further 2 mins until fragrant, then add the stock and marinated chicken. Cook for 15 mins, then add any remaining marinade left in the bowl. Simmer for 5 mins, then sprinkle with the toasted almonds. Serve with rice, naan bread, chutney, coriander and lime wedges, if you like.",
            "prep_time": "15",
            "cook_time": "35",
            "difficulty": "Easy",
            "serves": "4",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/butter-chicken-cf6f9e2.jpg?quality=90&webp=true&resize=440,400",
            "ingredients": [
                "500g skinless boneless chicken thighs",
                "2 tbsp vegetable oil",
                "1 large onion, chopped",
                "3 garlic cloves, crushed",
                "1 green chilli, deseeded and finely chopped (optional)",
                "thumb-sized piece ginger, grated",
                "1 tsp garam masala",
                "2 tsp ground fenugreek",
                "3 tbsp tomato purée",
                "300ml chicken stock",
                "50g flaked almonds, toasted"
            ],
            "nutritional_info": {
                "kcal": "367",
                "fat": "18g",
                "saturates": "3g",
                "carbs": "12g",
                "sugars": "10g",
                "fibre": "3g",
                "protein": "37g",
                "salt": "0.6g"
            }
        }
    ]
}